/* 切韻諺文
 *
 * https://zhuanlan.zhihu.com/p/570151415
 *
 * 基於：切韻拼音 (https://zhuanlan.zhihu.com/p/478751152)
 *
 * @author Mishiro
 */

if (!音韻地位) return [];

const is = (...x) => 音韻地位.屬於(...x);
const when = (...x) => 音韻地位.判斷(...x);

function 聲母() {
  return {
    // 牙音
    見: 'ᄀ', 溪: 'ᄏ', 羣: 'ᄁ', 疑: 'ᅌ',
    // 舌音
    端: 'ᄃ', 透: 'ᄐ', 定: 'ᄄ', 泥: 'ᄂ',
    知: 'ᄃ', 徹: 'ᄐ', 澄: 'ᄄ', 孃: 'ᄂ',
    // 脣音
    幫: 'ᄇ', 滂: 'ᄑ', 並: 'ᄈ', 明: 'ᄆ',
    // 齒音
    精: 'ᅎ', 清: 'ᅔ', 從: 'ᅏ', 心: 'ᄼ', 邪: 'ᄽ',
    莊: 'ᅐ', 初: 'ᅕ', 崇: 'ᅑ', 生: 'ᄾ', 俟: 'ᄿ',
    章: 'ᅐ', 昌: 'ᅕ', 常: 'ᅑ', 書: 'ᄾ', 船: 'ᄿ',
    // 喉音
    影: 'ᅙ', 曉: 'ᄒ', 匣: 'ᅘ', 云: 'ᄋ', 以: 'ᄋ',
    // 半舌音
    來: 'ᄅ',
    // 半齒音
    日: 'ᅀ',
  }[音韻地位.母];
}

function 韻母() {
  // 爲了方便推導，對韻類稍作調整
  const 韻 = when([
    ['東韻 三等', '終'],
    ['臻韻 或 莊組 欣韻 上聲', '眞'],
    ['歌韻 三等', '迦'],
    ['麻韻 三等', '遮'],
    ['陽韻 重紐A類', '剽'], // SIP 的 “𩦠” (U+299A0) 會影響後續代碼運行效果，用 BMP 的 “剽” (U+527D) 代替
    ['庚韻 三等', '清'],
    ['蒸韻 (重紐B類 或 幫組 或 合口)', '冰'],
    ['', 音韻地位.韻],
  ]);
  const 韻到終聲 = [
    ['脂支遮 之尤魚〇虞迦迦 侯〇〇模歌 佳〇麻', ''],
    ['〇〇剽 〇終〇〇鍾陽陽 東〇〇冬唐 〇江〇', 'ᇮ', 'ᆩ'],
    ['冰〇清 蒸〇〇〇〇〇〇 〇青登登〇 耕〇庚', 'ᇰ', 'ᆨ'],
    ['〇祭〇 微微廢廢〇〇〇 〇齊咍灰泰 皆〇夬', 'ᅵ'],
    ['眞仙〇 欣文元元〇〇〇 〇先痕魂寒 山〇刪', 'ᆫ', 'ᆮ'],
    ['幽宵〇 〇〇〇〇〇〇〇 〇蕭〇〇豪 〇〇肴', 'ᅮ'],
    ['侵鹽〇 〇〇嚴凡〇〇〇 〇添覃〇談 咸〇銜', 'ᆷ', 'ᆸ'],
  ];
  const 中聲列表 = [
    'ᅵ',  　   'ᅧ',  　    　    　   'ᅣ', 　    // 3A / 3B
    'ᅳ', 'ᅲ', 'ힺ', 'ᆏ',  　   'ᅭ', 'ퟅ', 'ힲ', // 3C
     　   'ᅮ', 'ᅥ',  　   'ᆞ', 'ᅩ', 'ᅡ', 　    // 1  / 4
     　    　   'ᅥ',  　    　   'ᅩ', 'ᅡ', 　    // 2
  ];

  let 匹配行 = 韻到終聲.find(行 => 行[0].includes(韻));
  let 中聲 = 中聲列表[匹配行[0].replace(/ /g, '')[is`開口` ? 'indexOf' : 'lastIndexOf'](韻)];
  let 終聲 = 匹配行[is`入聲` ? 2 : 1];

  // 添加合口介音
  if (is`合口`) {
    中聲 = { ᅵ: 'ᅱ', ᅧ: 'ힵ', ᅣ: 'ᆦ', ᅥ: 'ᅯ', ᅡ: 'ᅪ' }[中聲] || 中聲;
  }
  // 添加元音韻尾
  if (終聲 === 'ᅵ') {
    中聲 = { ᅧ: 'ᅨ', ힵ: 'ᆌ', ᅳ: 'ᅴ', ᅲ: 'ᆔ', ힺ: 'ힻ', ᆏ: 'ᆐ', ᅥ: 'ᅦ', ᅯ: 'ᅰ', ᆞ: 'ᆡ', ᅩ: 'ᅬ', ᅡ: 'ᅢ', ᅪ: 'ᅫ' }[中聲];
    終聲 = '';
  }
  if (終聲 === 'ᅮ') {
    中聲 = { ᅵ: 'ᆛ', ᅧ: 'ᅾ', ᅥ: 'ᅻ', ᅡ: 'ᅶ' }[中聲];
    終聲 = '';
  }
  // 添加終聲標記ㅅ
  if (is`二等 或 重紐B類 或 云母 或 知莊組 或 庚韻 或 蒸幽韻 幫組` && !['定開二佳上', '端開二庚上', '來開二庚上'].includes(音韻地位.描述)) {
    終聲 = { '': 'ᆺ', ᇮ: 'ᇱ', ᆩ: 'ᆪ', ᇰ: 'ᇱ', ᆨ: 'ᆪ', ᆫ: 'ᇇ', ᆮ: 'ퟐ', ᆷ: 'ᇝ', ᆸ: 'ᆹ' }[終聲];
  }

  return 中聲 + 終聲;
}

function 聲調() {
  return { 上: '〯', 去: '〮', 入: '〮' }[音韻地位.聲] || '';
}

return 聲母() + 韻母() + 聲調();
